In [3]:
import numpy as np
from IPython.display import display
import pandas as pd

In [4]:
data = {
    "Name": ["Alice", "Bob", "Charlie", "Diana", "Evan"],
    "Age": [25, 30, 35, 28, 40],
    "Salary": [50000, 60000, 75000, 62000, 80000],
    "Department": ["HR", "IT", "Finance", "IT", "HR"]
}

df = pd.DataFrame(data)
print(df)

      Name  Age  Salary Department
0    Alice   25   50000         HR
1      Bob   30   60000         IT
2  Charlie   35   75000    Finance
3    Diana   28   62000         IT
4     Evan   40   80000         HR

In [47]:
#Task 1:
#Select rows and columns with .iloc
print(df.iloc[:,:])
print()
#Get the first 3 rows and only the Name and Salary columns
print(df.loc[:2,['Name', 'Salary']])

      Name  Age  Salary Department
0    Alice   25   50000         HR
1      Bob   30   60000         IT
2  Charlie   35   75000    Finance
3    Diana   28   62000         IT
4     Evan   40   80000         HR

      Name  Salary
0    Alice   50000
1      Bob   60000
2  Charlie   75000

In [50]:
#Task 2:
#Add a new calculated column- 
#Create a column Bonus that is 10% of the Salary

df['Bonus'] = 0.1 * df['Salary'] 
print(df)

      Name  Age  Salary Department   Bonus
0    Alice   25   50000         HR  5000.0
1      Bob   30   60000         IT  6000.0
2  Charlie   35   75000    Finance  7500.0
3    Diana   28   62000         IT  6200.0
4     Evan   40   80000         HR  8000.0

In [13]:
data = {
    "Name": ["Alice", "Bob", "Charlie", "Diana", "Evan"],
    "Age": [25, 30, 35, 28, 40],
    "Salary": [50000, 60000, 75000, 62000, 80000],
    "Department": ["HR", "IT", "Finance", "IT", "HR"]
}

df = pd.DataFrame(data)
print(df)


#Task 3:
# Change the index:
# Set the Name column as the new index

df.set_index('Name', inplace = True)
print(df)

# Display all rows from Bob to Diana and only Salary and Department columns

df = df.loc['Bob':'Diana', ['Salary', 'Department']]
print(df)

# Then reset it back to the default numeric index

df.reset_index(inplace = True)
df

      Name  Age  Salary Department
0    Alice   25   50000         HR
1      Bob   30   60000         IT
2  Charlie   35   75000    Finance
3    Diana   28   62000         IT
4     Evan   40   80000         HR
         Age  Salary Department
Name
Alice     25   50000         HR
Bob       30   60000         IT
Charlie   35   75000    Finance
Diana     28   62000         IT
Evan      40   80000         HR
         Salary Department
Name
Bob       60000         IT
Charlie   75000    Finance
Diana     62000         IT

      Name  Salary Department
0      Bob   60000         IT
1  Charlie   75000    Finance
2    Diana   62000         IT